TestConf/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestConf/src/Documents/Продажи/Forms/DocumentForm/Module.bsl
&AtClient
Procedure СоставЦенаOnChange(Item)
	текСтрока = Элементы.Состав.CurrentData;
	ОбновитьСумму(ТекСтрока)
EndProcedure
// @strict-types

&AtClient
Procedure ОбновитьСумму(текСтрока)
	текСтрока.Сумма = текСтрока.Количество * текСтрока.Цена;
EndProcedure

&AtClient
Procedure СоставКоличествоOnChange(Item)
	текСтрока = Элементы.Состав.CurrentData;
	ОбновитьСумму(ТекСтрока)
EndProcedure
